package com.abcs.hqbtravel.entity;

import com.google.gson.annotations.SerializedName;

import java.util.List;

/**
 * Created by Administrator on 2016/9/9.
 */
public class BiMai {

    /**
     * shops : [{"id":"1155","name":"尖沙咀","star":4.32,"distance":"30km","photo":"http://qhcdn.oss-cn-hangzhou.aliyuncs.com/hqb/Img/qyer_shop_img/1155.jpg","introduction":"尖沙咀可以说是香港的\u201c地理中心\u201d，所以去哪里都方便，自然人气旺。随着98年旧启德机场搬走后，这一区的高楼大厦便不断重建，商场也越来越多。这里有全港最大的购物中心海港城，也有最\u201c国际化\u201d的重庆大厦；有名店街广东道，也有人气颇高的加连威老道；有连卡佛，也有Outlet。这两年还连开iSquare、K11、TheOne三家购物中心，可见是商家必争之地。尖沙咀可以说是适合一家大小首选的购物地!","range":30,"been":11287,"cates":["购物街/商圈"]},{"id":"1156","name":"中环","star":4.315,"distance":"31km","photo":"http://qhcdn.oss-cn-hangzhou.aliyuncs.com/hqb/Img/qyer_shop_img/1156.jpg","introduction":"处于香港的心脏地带，自开埠以来，中环就成为香港的金融市场中心，是香港租金最贵的地方之一。能在这里开上一间店铺，多数非富则贵。所以这一带汇集了基本上所有叫得上名的和叫不上名的国际一线品牌，同时多数又是旗舰店，如果它在香港只有一家分店，那基本上都逃不出中环。所以，如果想在最短的时间看最多的名牌，中环是不二之选。中环是香港最早开埠的地区之一，这里的不少建筑同时也相当有历史。在这一旧一新的对比下，就算不买什么，随意走走也是一种感官上的享受。\r\n\r\n同时，中环也是高级购物饮食区，名店林立。著名的兰桂坊、苏豪(SOHO)是酒吧和餐厅的集中地，每晚均有大量老外和游客到此体验香港的夜生活，西方节日尤甚。除了商业化的一面外，中环区内还是保留了很多\u201c老香港\u201d文化的街道、建筑等，诉说着多年来的香港故事。\r\n\r\n建议由石板街(砵典乍街)一直沿着荷里活道向上行，沿途除了有殖民色彩浓厚的旧中区警署、域多利监狱等经典香港历史建筑外，还可以找到形形色色的老店和卖酱醋、凉果，补伞，做纸扎等快要消亡的传统行业。早上到中环各种露天开放式街市溜达，如卑利街街市、结志街街市等，可以更好的了解香港居民的原生活。此外，全世界最长的户外有盖行人扶手电梯\u2014中环至半山自动扶梯也是体验中环的一种方法。","range":31,"been":7206,"cates":["购物街/商圈"]},{"id":"1157","name":"铜锣湾","star":4.345,"distance":"32km","photo":"http://qhcdn.oss-cn-hangzhou.aliyuncs.com/hqb/Img/qyer_shop_img/1157.jpg","introduction":"铜锣湾是港岛繁华的商业区，是全世界租金第二贵的地段(仅次于纽约第五大道)，听过\u201c下一站，天后\u201d的人们应该对这一区的 时代广场、百德新街、大丸、天后都不陌生，港岛区的居民常说住在铜锣湾就不想搬去其它地方，可见这里有多便利。 铜锣湾在八十年代，是日资百货公司的主战场，全盛时期有大丸、 松坂屋、三越及崇光四家，号称\u201c小东京\u201d。往铜锣湾西的小巴至今车头灯名依然显示\u201c大丸\u201d，可见其影响力。虽然现在只剩下崇光一家(事实上也早已卖给本地商人)，但本地的购物中心却越开越多。和中环不同，铜锣湾本身及周边都是住宅区，其人流堪比旺角。2012年铜锣湾的店铺租金打破纽约第五大道11年的一哥地位，罗素街一带以月租约14700人民币/平方米名列全球最贵购物街，可见铜锣湾的人流有多么旺盛。 新地标希慎广场的新开幕和其中的诚品书店为铜锣湾增添了新的吸引力。除了购物之外，这里也林立着无数充满特色的二楼书店和Café，逢赛马日可以去跑马地放手一搏，信风水的还可以去鹅颈桥看看打小人。","range":32,"been":5109,"cates":["购物街/商圈"]},{"id":"1158","name":"海港城","star":4.245,"distance":"30km","photo":"http://qhcdn.oss-cn-hangzhou.aliyuncs.com/hqb/Img/qyer_shop_img/1158.jpg","introduction":"如果你的时间只能去一个地方购物，又或者不知道去哪买东西，那就去海港城逛逛吧！海港城是香港面积最大的商场，约200万平方尺，600多间商铺，涵盖了各个类型的商品。分为5个购物区：海运 大厦(以儿童、运动、年轻为主题)、海洋中心、马可波罗酒店商场 (连卡佛)、港威和星光城(电脑、音响)。其沿广东道沿线的名店街是最大的亮点，各种一线品牌店铺连城一线非常壮观，但是也永远有人在门口排队等入场呢。","range":30,"been":3474,"cates":["购物街/商圈","购物中心/商城"]},{"id":"1159","name":"香港国际金融中心","star":4.26,"distance":"31km","photo":"http://qhcdn.oss-cn-hangzhou.aliyuncs.com/hqb/Img/qyer_shop_img/1159.jpg","introduction":"香港国际金融中心是香港作为世界级金融中心的著名地标，位于香港岛中环金融街8号，地铁东涌线和机场快线香港站的上边，面向维多利亚港。由地铁公司(今港铁公司)及新鸿基地产、恒基兆业、香港中华煤气及中银香港属下新中地产所组成的IFCDevelopmentLimited发展、著名美籍建筑师CésarPelli及香港建筑师严迅奇合作设计而成，总楼面面积达43万6千平方米。现为恒基兆业集团和香港金融管理局的总部所在地。\r\n\r\n国金商场地面层南侧为机场快线市区预办登机服务区，可以为大多数航空公司预办登机牌和托运行李，这样就可以放下行李，在前往机场前来一次最后的\u201c血拼\u201d。机场快线往来市区和机场只需要24分钟，所以如果在香港转机的旅行者有5、6个小时以上的时间，也可以考虑来此一游。国金商场里面的连卡佛是香港最大的一家，也是货品最多最全的一家。同时这里的Apple Store占据上下两层显眼位置。逛累了晚上就到商场的电影院Palaceifc看场电影吧，这家影院的座椅为全皮沙发，是全港最舒服的影院之一。","range":31,"been":3173,"cates":["购物中心/商城"]},{"id":"1160","name":"旺角","star":4.23,"distance":"29km","photo":"http://qhcdn.oss-cn-hangzhou.aliyuncs.com/hqb/Img/qyer_shop_img/1160.jpg","introduction":"旺角位于香港的油尖旺区，即九龙西部。新旧楼宇林立；旧住宅楼宇地铺多为商店或餐厅。以弥敦道为界，购物中心集中在东面，住宅区在西面。交通十分发逹，有巴士及港铁（东铁线、荃湾线和观塘线），更有专线小巴通宵行驶。","range":29,"been":2699,"cates":["主题观光","地标","购物街/商圈","街区"]},{"id":"1161","name":"时代广场","star":4.25,"distance":"33km","photo":"http://qhcdn.oss-cn-hangzhou.aliyuncs.com/hqb/Img/qyer_shop_img/1161.jpg","introduction":"时代广场的店铺定位跨度比较大，总的来说中档偏上。商场的平面布置简单明了，不会迷路。这里的连卡佛里还有四部全港唯一的弧形扶手电梯。在每年除夕夜，时代广场会模仿美国时代广场，有大型倒数迎新年活动，气氛不错。","range":33,"been":2133,"cates":["购物街/商圈","购物中心/商城"]},{"id":"1162","name":"崇光百货","star":4.15,"distance":"32km","photo":"http://qhcdn.oss-cn-hangzhou.aliyuncs.com/hqb/Img/qyer_shop_img/1162.jpg","introduction":"在购物中心为主的年代，百货商场的形式似乎已经势微，但崇光百货 在香港绝对是一个例外。崇光百货既然是\u201c百货\u201d商场，其店铺种类绝对是首屈一指的，从服饰、鞋子、包，到各种家用品，充满了多达19层的购物面积，以传统百货的类型分层，商品高中低齐全，老少皆宜。","range":32,"been":1849,"cates":["购物中心/商城"]},{"id":"1163","name":"太古广场","star":4.31,"distance":"32km","photo":"http://qhcdn.oss-cn-hangzhou.aliyuncs.com/hqb/Img/qyer_shop_img/1163.jpg","introduction":"太古广场是香港购物中心的先驱者，非常漂亮，其位置距离中环也很近。汇聚港丽酒店、港岛香格里拉酒店和万豪酒店三家五星级酒店以及一家豪华酒店，是太古广场特色之一。这些酒店以电梯与商场和金钟港铁交汇站相连，同时经香港公园连接山顶缆车站，位置非常优越。\r\n\r\n这里的店铺有一线名牌，也有潮流服饰，而且这里的人不多，逛起来很舒服。商场3楼云集奢华世界品牌，2楼为创意名店的集中地，1楼为优质生活用品及美容品牌的缤纷舞台，低层设有多元化食肆，地库更有独家国际超级市场，加上两家高级百货公司。从华丽时装服饰以至个人美容产品，太古广场均奉上优质称心的选择。\r\n\r\n太古广场内有30多家餐厅，以中高档为主。逛累了到4楼露天平台的The Petit Café坐坐。太古广场对面的统一中心地面层有数家实惠的中西快餐店可供选择。不嫌远的话，通过地下通道往太古广场三期，走出马路往北走入湾仔星街、月街、日街一带，这里多已被改造成附有异域风情的西餐厅。若再多走几分钟到兰杜街，这里有数家物美价廉的餐馆，大名鼎鼎的荣氏鸡扒也在此。和中环一样，金钟一带也是汇集了大量写字楼，工作日中午时间吃饭或早或晚，避开高峰。","range":32,"been":1287,"cates":["购物中心/商城"]},{"id":"1164","name":"东荟城","star":4.06,"distance":"28km","photo":"http://qhcdn.oss-cn-hangzhou.aliyuncs.com/hqb/Img/qyer_shop_img/1164.jpg","introduction":"是香港唯一的大型名牌折扣商场，一般都可以用大概3-7折买到各种名牌产品，如Nike、Adidas、Columbia、Esprit、Levi\u2019s、Timberland、Laura Ashley、Samsonite等。另外，银联卡在商城内不定期有各种优惠，记得带上！商场内的美食中心有数十家价廉物美的食肆供选择。","range":28,"been":1890,"cates":["购物街/商圈","购物中心/商城"]}]
     * next : 2
     * pageCount : 1
     */

    @SerializedName("body")
    public BodyBean body;
    /**
     * body : {"shops":[{"id":"1155","name":"尖沙咀","star":4.32,"distance":"30km","photo":"http://qhcdn.oss-cn-hangzhou.aliyuncs.com/hqb/Img/qyer_shop_img/1155.jpg","introduction":"尖沙咀可以说是香港的\u201c地理中心\u201d，所以去哪里都方便，自然人气旺。随着98年旧启德机场搬走后，这一区的高楼大厦便不断重建，商场也越来越多。这里有全港最大的购物中心海港城，也有最\u201c国际化\u201d的重庆大厦；有名店街广东道，也有人气颇高的加连威老道；有连卡佛，也有Outlet。这两年还连开iSquare、K11、TheOne三家购物中心，可见是商家必争之地。尖沙咀可以说是适合一家大小首选的购物地!","range":30,"been":11287,"cates":["购物街/商圈"]},{"id":"1156","name":"中环","star":4.315,"distance":"31km","photo":"http://qhcdn.oss-cn-hangzhou.aliyuncs.com/hqb/Img/qyer_shop_img/1156.jpg","introduction":"处于香港的心脏地带，自开埠以来，中环就成为香港的金融市场中心，是香港租金最贵的地方之一。能在这里开上一间店铺，多数非富则贵。所以这一带汇集了基本上所有叫得上名的和叫不上名的国际一线品牌，同时多数又是旗舰店，如果它在香港只有一家分店，那基本上都逃不出中环。所以，如果想在最短的时间看最多的名牌，中环是不二之选。中环是香港最早开埠的地区之一，这里的不少建筑同时也相当有历史。在这一旧一新的对比下，就算不买什么，随意走走也是一种感官上的享受。\r\n\r\n同时，中环也是高级购物饮食区，名店林立。著名的兰桂坊、苏豪(SOHO)是酒吧和餐厅的集中地，每晚均有大量老外和游客到此体验香港的夜生活，西方节日尤甚。除了商业化的一面外，中环区内还是保留了很多\u201c老香港\u201d文化的街道、建筑等，诉说着多年来的香港故事。\r\n\r\n建议由石板街(砵典乍街)一直沿着荷里活道向上行，沿途除了有殖民色彩浓厚的旧中区警署、域多利监狱等经典香港历史建筑外，还可以找到形形色色的老店和卖酱醋、凉果，补伞，做纸扎等快要消亡的传统行业。早上到中环各种露天开放式街市溜达，如卑利街街市、结志街街市等，可以更好的了解香港居民的原生活。此外，全世界最长的户外有盖行人扶手电梯\u2014中环至半山自动扶梯也是体验中环的一种方法。","range":31,"been":7206,"cates":["购物街/商圈"]},{"id":"1157","name":"铜锣湾","star":4.345,"distance":"32km","photo":"http://qhcdn.oss-cn-hangzhou.aliyuncs.com/hqb/Img/qyer_shop_img/1157.jpg","introduction":"铜锣湾是港岛繁华的商业区，是全世界租金第二贵的地段(仅次于纽约第五大道)，听过\u201c下一站，天后\u201d的人们应该对这一区的 时代广场、百德新街、大丸、天后都不陌生，港岛区的居民常说住在铜锣湾就不想搬去其它地方，可见这里有多便利。 铜锣湾在八十年代，是日资百货公司的主战场，全盛时期有大丸、 松坂屋、三越及崇光四家，号称\u201c小东京\u201d。往铜锣湾西的小巴至今车头灯名依然显示\u201c大丸\u201d，可见其影响力。虽然现在只剩下崇光一家(事实上也早已卖给本地商人)，但本地的购物中心却越开越多。和中环不同，铜锣湾本身及周边都是住宅区，其人流堪比旺角。2012年铜锣湾的店铺租金打破纽约第五大道11年的一哥地位，罗素街一带以月租约14700人民币/平方米名列全球最贵购物街，可见铜锣湾的人流有多么旺盛。 新地标希慎广场的新开幕和其中的诚品书店为铜锣湾增添了新的吸引力。除了购物之外，这里也林立着无数充满特色的二楼书店和Café，逢赛马日可以去跑马地放手一搏，信风水的还可以去鹅颈桥看看打小人。","range":32,"been":5109,"cates":["购物街/商圈"]},{"id":"1158","name":"海港城","star":4.245,"distance":"30km","photo":"http://qhcdn.oss-cn-hangzhou.aliyuncs.com/hqb/Img/qyer_shop_img/1158.jpg","introduction":"如果你的时间只能去一个地方购物，又或者不知道去哪买东西，那就去海港城逛逛吧！海港城是香港面积最大的商场，约200万平方尺，600多间商铺，涵盖了各个类型的商品。分为5个购物区：海运 大厦(以儿童、运动、年轻为主题)、海洋中心、马可波罗酒店商场 (连卡佛)、港威和星光城(电脑、音响)。其沿广东道沿线的名店街是最大的亮点，各种一线品牌店铺连城一线非常壮观，但是也永远有人在门口排队等入场呢。","range":30,"been":3474,"cates":["购物街/商圈","购物中心/商城"]},{"id":"1159","name":"香港国际金融中心","star":4.26,"distance":"31km","photo":"http://qhcdn.oss-cn-hangzhou.aliyuncs.com/hqb/Img/qyer_shop_img/1159.jpg","introduction":"香港国际金融中心是香港作为世界级金融中心的著名地标，位于香港岛中环金融街8号，地铁东涌线和机场快线香港站的上边，面向维多利亚港。由地铁公司(今港铁公司)及新鸿基地产、恒基兆业、香港中华煤气及中银香港属下新中地产所组成的IFCDevelopmentLimited发展、著名美籍建筑师CésarPelli及香港建筑师严迅奇合作设计而成，总楼面面积达43万6千平方米。现为恒基兆业集团和香港金融管理局的总部所在地。\r\n\r\n国金商场地面层南侧为机场快线市区预办登机服务区，可以为大多数航空公司预办登机牌和托运行李，这样就可以放下行李，在前往机场前来一次最后的\u201c血拼\u201d。机场快线往来市区和机场只需要24分钟，所以如果在香港转机的旅行者有5、6个小时以上的时间，也可以考虑来此一游。国金商场里面的连卡佛是香港最大的一家，也是货品最多最全的一家。同时这里的Apple Store占据上下两层显眼位置。逛累了晚上就到商场的电影院Palaceifc看场电影吧，这家影院的座椅为全皮沙发，是全港最舒服的影院之一。","range":31,"been":3173,"cates":["购物中心/商城"]},{"id":"1160","name":"旺角","star":4.23,"distance":"29km","photo":"http://qhcdn.oss-cn-hangzhou.aliyuncs.com/hqb/Img/qyer_shop_img/1160.jpg","introduction":"旺角位于香港的油尖旺区，即九龙西部。新旧楼宇林立；旧住宅楼宇地铺多为商店或餐厅。以弥敦道为界，购物中心集中在东面，住宅区在西面。交通十分发逹，有巴士及港铁（东铁线、荃湾线和观塘线），更有专线小巴通宵行驶。","range":29,"been":2699,"cates":["主题观光","地标","购物街/商圈","街区"]},{"id":"1161","name":"时代广场","star":4.25,"distance":"33km","photo":"http://qhcdn.oss-cn-hangzhou.aliyuncs.com/hqb/Img/qyer_shop_img/1161.jpg","introduction":"时代广场的店铺定位跨度比较大，总的来说中档偏上。商场的平面布置简单明了，不会迷路。这里的连卡佛里还有四部全港唯一的弧形扶手电梯。在每年除夕夜，时代广场会模仿美国时代广场，有大型倒数迎新年活动，气氛不错。","range":33,"been":2133,"cates":["购物街/商圈","购物中心/商城"]},{"id":"1162","name":"崇光百货","star":4.15,"distance":"32km","photo":"http://qhcdn.oss-cn-hangzhou.aliyuncs.com/hqb/Img/qyer_shop_img/1162.jpg","introduction":"在购物中心为主的年代，百货商场的形式似乎已经势微，但崇光百货 在香港绝对是一个例外。崇光百货既然是\u201c百货\u201d商场，其店铺种类绝对是首屈一指的，从服饰、鞋子、包，到各种家用品，充满了多达19层的购物面积，以传统百货的类型分层，商品高中低齐全，老少皆宜。","range":32,"been":1849,"cates":["购物中心/商城"]},{"id":"1163","name":"太古广场","star":4.31,"distance":"32km","photo":"http://qhcdn.oss-cn-hangzhou.aliyuncs.com/hqb/Img/qyer_shop_img/1163.jpg","introduction":"太古广场是香港购物中心的先驱者，非常漂亮，其位置距离中环也很近。汇聚港丽酒店、港岛香格里拉酒店和万豪酒店三家五星级酒店以及一家豪华酒店，是太古广场特色之一。这些酒店以电梯与商场和金钟港铁交汇站相连，同时经香港公园连接山顶缆车站，位置非常优越。\r\n\r\n这里的店铺有一线名牌，也有潮流服饰，而且这里的人不多，逛起来很舒服。商场3楼云集奢华世界品牌，2楼为创意名店的集中地，1楼为优质生活用品及美容品牌的缤纷舞台，低层设有多元化食肆，地库更有独家国际超级市场，加上两家高级百货公司。从华丽时装服饰以至个人美容产品，太古广场均奉上优质称心的选择。\r\n\r\n太古广场内有30多家餐厅，以中高档为主。逛累了到4楼露天平台的The Petit Café坐坐。太古广场对面的统一中心地面层有数家实惠的中西快餐店可供选择。不嫌远的话，通过地下通道往太古广场三期，走出马路往北走入湾仔星街、月街、日街一带，这里多已被改造成附有异域风情的西餐厅。若再多走几分钟到兰杜街，这里有数家物美价廉的餐馆，大名鼎鼎的荣氏鸡扒也在此。和中环一样，金钟一带也是汇集了大量写字楼，工作日中午时间吃饭或早或晚，避开高峰。","range":32,"been":1287,"cates":["购物中心/商城"]},{"id":"1164","name":"东荟城","star":4.06,"distance":"28km","photo":"http://qhcdn.oss-cn-hangzhou.aliyuncs.com/hqb/Img/qyer_shop_img/1164.jpg","introduction":"是香港唯一的大型名牌折扣商场，一般都可以用大概3-7折买到各种名牌产品，如Nike、Adidas、Columbia、Esprit、Levi\u2019s、Timberland、Laura Ashley、Samsonite等。另外，银联卡在商城内不定期有各种优惠，记得带上！商场内的美食中心有数十家价廉物美的食肆供选择。","range":28,"been":1890,"cates":["购物街/商圈","购物中心/商城"]}],"next":2,"pageCount":1}
     * result : 1
     * timestamp : 1478761374336
     * version : 1.0
     * transactionid : null
     */

    @SerializedName("result")
    public int result;
    @SerializedName("timestamp")
    public String timestamp;
    @SerializedName("version")
    public String version;
    @SerializedName("transactionid")
    public String transactionid;

    public static class BodyBean {
        @SerializedName("next")
        public int next;
        @SerializedName("pageCount")
        public int pageCount;
        /**
         * id : 1155
         * name : 尖沙咀
         * star : 4.32
         * distance : 30km
         * photo : http://qhcdn.oss-cn-hangzhou.aliyuncs.com/hqb/Img/qyer_shop_img/1155.jpg
         * introduction : 尖沙咀可以说是香港的“地理中心”，所以去哪里都方便，自然人气旺。随着98年旧启德机场搬走后，这一区的高楼大厦便不断重建，商场也越来越多。这里有全港最大的购物中心海港城，也有最“国际化”的重庆大厦；有名店街广东道，也有人气颇高的加连威老道；有连卡佛，也有Outlet。这两年还连开iSquare、K11、TheOne三家购物中心，可见是商家必争之地。尖沙咀可以说是适合一家大小首选的购物地!
         * range : 30
         * been : 11287
         * cates : ["购物街/商圈"]
         */

        @SerializedName("shops")
        public List<ShopBean> shops;

    }
}
